docs/topic_modelling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-23 Thu 15:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Topic Modeling</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Topic Modeling</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfbe20d1">1. LDA</a>
<ul>
<li>
<ul>
<li><a href="#org124888d">1.0.1. Dirichlet Distribution</a></li>
<li><a href="#orga952c81">1.0.2. Exploring a Corpus with the posterior distribution</a></li>
<li><a href="#org6fe0379">1.0.3. Posterior Inference</a>
<ul>
<li><a href="#org51223a9">1.0.3.1. Mean Field Variational Inference</a></li>
</ul>
</li>
<li><a href="#orgd0c40fa">1.0.4. Markov Chains</a></li>
<li><a href="#orgf15a5d9">1.0.5. Shortcomings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb38acb8">2. TopicRNN</a></li>
<li><a href="#org9b5a786">3. Potential Research Topics</a>
<ul>
<li><a href="#orgfa1305b">3.1. <span class="todo TODO">TODO</span> Visualization of Perplexity for topic models as a potential topic?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://www.cs.columbia.edu/~blei/topicmodeling.html">http://www.cs.columbia.edu/~blei/topicmodeling.html</a>
<a href="https://github.com/jethrokuan/lda-survey">LDA survey - Github</a>
</p>

<div id="outline-container-orgfbe20d1" class="outline-2">
<h2 id="orgfbe20d1"><span class="section-number-2">1</span> LDA</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://ldabook.com/">The Little Book on LDA</a>
<a href="https://www.youtube.com/watch?v=FkckgwMHP2s">https://www.youtube.com/watch?v=FkckgwMHP2s</a>
<a href="http://www.cs.columbia.edu/~blei/papers/Blei2012.pdf">http://www.cs.columbia.edu/~blei/papers/Blei2012.pdf</a>
</p>
</div>
<div id="outline-container-org124888d" class="outline-4">
<h4 id="org124888d"><span class="section-number-4">1.0.1</span> Dirichlet Distribution</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
<a href="https://www2.ee.washington.edu/techsite/papers/documents/UWEETR-2010-0006.pdf">https://www2.ee.washington.edu/techsite/papers/documents/UWEETR-2010-0006.pdf</a>
</p>

<p>
Dirichlet distribution is a family of continuous multivariate
probability distributions parameterized by a vector α of positive
reals.
</p>

\begin{equation}
  \theta \sim Dir(\alpha)
\end{equation}

\begin{equation}
  p(\theta) = \frac{1}{\beta(\alpha)} \prod_{i=1}^n \theta_i^{\alpha_i-1} I(\theta \in S)
\end{equation}

<p>
Where \(\theta = (\theta_1, \theta_2, \hdots, \theta_n), \alpha = (\alpha_1, \alpha_2, \hdots, \alpha_n), \alpha_i > 0\) and
</p>

\begin{equation}
  S = \left\{x \in \mathbb{R}^n : x_i \ge 0, \sum_{i=1}^{n} x_i = 1 \right\}
\end{equation}

<p>
and 
\(\frac{1}{\beta(\alpha)} =
\frac{\Gamma(\alpha_0)}{\Gamma(\alpha_1)\Gamma(\alpha_2)\hdots\Gamma(\alpha_n)}\)
</p>

<p>
The infinite-dimensional generalization of the Dirichlet distribution
is the Dirichlet process.
</p>

<p>
The Dirichlet distribution is the conjugate prior distribution of the
categorical distribution (a generic discrete probability distribution
with a given number of possible outcomes) and multinomial distribution
(the distribution over observed counts of each possible category in a
set of categorically distributed observations). This means that if a
data point has either a categorical or multinomial distribution, and
the prior distribution of the distribution's parameter (the vector of
probabilities that generates the data point) is distributed as a
Dirichlet, then the posterior distribution of the parameter is also a
Dirichlet.
</p>
</div>
</div>
<div id="outline-container-orga952c81" class="outline-4">
<h4 id="orga952c81"><span class="section-number-4">1.0.2</span> Exploring a Corpus with the posterior distribution</h4>
<div class="outline-text-4" id="text-1-0-2">
<p>
Quantities needed for exploring a corpus are the posterior
expectations of hidden variables. Each of these quantities are
conditioned on the observed corpus.
</p>

<p>
Visualizing a topic is done by visualizing the posterior topics
through their per-topic probabilities \(\hat{\beta}\).
</p>

<p>
Visualizing a document uses the posterior topic proportions
\(\hat{\theta}_{d,k}\) and the posterior topic assignments
\(\hat{z}_{d,k}\).
</p>

<p>
Finding similar documents can be done through the <i>Hellinger
distance</i>:
</p>

\begin{align*}
  D_{d,k} = \sum_{k=1}^K \left( \sqrt{\hat{\theta}_{d,k}} - \sqrt{\hat{\theta}_{f,k}}\right)^2
\end{align*}
</div>
</div>
<div id="outline-container-org6fe0379" class="outline-4">
<h4 id="org6fe0379"><span class="section-number-4">1.0.3</span> Posterior Inference</h4>
<div class="outline-text-4" id="text-1-0-3">
</div>
<div id="outline-container-org51223a9" class="outline-5">
<h5 id="org51223a9"><span class="section-number-5">1.0.3.1</span> Mean Field Variational Inference</h5>
<div class="outline-text-5" id="text-1-0-3-1">
<p>
Approximate intractable posterior distribution with a simpler
distribution containing free variational parameters. These parameters
are fit to approximate the true posterior.
</p>

<p>
In contrast to the true posterior, the mean field variational
distribution for LDA is one where the variables are independent of
each other, with and each governed by a different variational
parameter.
</p>

<p>
We fit the variational parameters to minimise the KL-divergence to the
true posterior.
</p>

<p>
The general approach to mean-field variational methods - update each
variational parameter with the parameter given by the expectation of
the true posterior under the variational distribution - is applicable
when the conditional distribution of each variable is the exponential
family.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd0c40fa" class="outline-4">
<h4 id="orgd0c40fa"><span class="section-number-4">1.0.4</span> Markov Chains</h4>
<div class="outline-text-4" id="text-1-0-4">
<p>
<a href="http://setosa.io/ev/markov-chains/">http://setosa.io/ev/markov-chains/</a>
</p>
</div>
</div>
<div id="outline-container-orgf15a5d9" class="outline-4">
<h4 id="orgf15a5d9"><span class="section-number-4">1.0.5</span> Shortcomings</h4>
<div class="outline-text-4" id="text-1-0-5">
<ul class="org-ul">
<li>strong, potentially invalid statistical assumptions:
<ul class="org-ul">
<li>topics have no correlation to one another (dirichlet assumes
nearly independent)
<ul class="org-ul">
<li>solution: CTM: use a logistic normal distribution</li>
</ul></li>
<li>assumes order of documents don't matter
<ul class="org-ul">
<li>solution: DTM: use logistic normal distribution to model topics
evolving over time</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb38acb8" class="outline-2">
<h2 id="orgb38acb8"><span class="section-number-2">2</span> TopicRNN</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://www.columbia.edu/~jwp2128/Papers/DiengWangetal2017.pdf">http://www.columbia.edu/~jwp2128/Papers/DiengWangetal2017.pdf</a> 
</p>

<p>
In TopicRNN, latent topic models are used to capture global semantic
dependencies so that the RNN can focus its modeling capacity on the
local dynamics of the sequences
</p>
</div>
</div>
<div id="outline-container-org9b5a786" class="outline-2">
<h2 id="org9b5a786"><span class="section-number-2">3</span> Potential Research Topics</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfa1305b" class="outline-3">
<h3 id="orgfa1305b"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Visualization of Perplexity for topic models as a potential topic?</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-23 Thu 15:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
